earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Raspberry Pi Pico (pico-debug)
# -----------------------------------
rpipicopicodebug.name=Raspberry Pi Pico (pico-debug)
rpipicopicodebug.vid.0=0x1209
rpipicopicodebug.pid.0=0x2488
rpipicopicodebug.build.usbpid=-DSERIALUSB_PID=0x000a
rpipicopicodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=250
rpipicopicodebug.build.board=RASPBERRY_PI_PICO
rpipicopicodebug.build.mcu=cortex-m0plus
rpipicopicodebug.build.variant=rpipico
rpipicopicodebug.upload.tool=picodebug
rpipicopicodebug.upload.maximum_size=2097152
rpipicopicodebug.upload.maximum_data_size=245760
rpipicopicodebug.upload.wait_for_upload_port=true
rpipicopicodebug.upload.erase_cmd=
rpipicopicodebug.serial.disableDTR=false
rpipicopicodebug.serial.disableRTS=false
rpipicopicodebug.build.f_cpu=125000000
rpipicopicodebug.build.led=
rpipicopicodebug.build.core=rp2040
rpipicopicodebug.build.ldscript=memmap_default.ld
rpipicopicodebug.build.ram_length=240k
rpipicopicodebug.build.boot2=boot2_w25q080_2_padded_checksum
rpipicopicodebug.build.vid=0x2e8a
rpipicopicodebug.build.pid=0x000a
rpipicopicodebug.build.usb_manufacturer="Raspberry Pi"
rpipicopicodebug.build.usb_product="Pico (pico-debug)"
rpipicopicodebug.menu.flash.2097152_0=2MB (no FS)
rpipicopicodebug.menu.flash.2097152_0.upload.maximum_size=2093056
rpipicopicodebug.menu.flash.2097152_0.build.flash_length=2093056
rpipicopicodebug.menu.flash.2097152_0.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_0.build.fs_start=270528512
rpipicopicodebug.menu.flash.2097152_0.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
rpipicopicodebug.menu.flash.2097152_65536.upload.maximum_size=2027520
rpipicopicodebug.menu.flash.2097152_65536.build.flash_length=2027520
rpipicopicodebug.menu.flash.2097152_65536.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_65536.build.fs_start=270462976
rpipicopicodebug.menu.flash.2097152_65536.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
rpipicopicodebug.menu.flash.2097152_131072.upload.maximum_size=1961984
rpipicopicodebug.menu.flash.2097152_131072.build.flash_length=1961984
rpipicopicodebug.menu.flash.2097152_131072.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_131072.build.fs_start=270397440
rpipicopicodebug.menu.flash.2097152_131072.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
rpipicopicodebug.menu.flash.2097152_262144.upload.maximum_size=1830912
rpipicopicodebug.menu.flash.2097152_262144.build.flash_length=1830912
rpipicopicodebug.menu.flash.2097152_262144.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_262144.build.fs_start=270266368
rpipicopicodebug.menu.flash.2097152_262144.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
rpipicopicodebug.menu.flash.2097152_524288.upload.maximum_size=1568768
rpipicopicodebug.menu.flash.2097152_524288.build.flash_length=1568768
rpipicopicodebug.menu.flash.2097152_524288.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_524288.build.fs_start=270004224
rpipicopicodebug.menu.flash.2097152_524288.build.fs_end=270528512
rpipicopicodebug.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
rpipicopicodebug.menu.flash.2097152_1048576.upload.maximum_size=1044480
rpipicopicodebug.menu.flash.2097152_1048576.build.flash_length=1044480
rpipicopicodebug.menu.flash.2097152_1048576.build.eeprom_start=270528512
rpipicopicodebug.menu.flash.2097152_1048576.build.fs_start=269479936
rpipicopicodebug.menu.flash.2097152_1048576.build.fs_end=270528512
rpipicopicodebug.menu.freq.125=125 MHz
rpipicopicodebug.menu.freq.125.build.f_cpu=125000000L
rpipicopicodebug.menu.freq.50=50 MHz
rpipicopicodebug.menu.freq.50.build.f_cpu=50000000L
rpipicopicodebug.menu.freq.100=100 MHz
rpipicopicodebug.menu.freq.100.build.f_cpu=100000000L
rpipicopicodebug.menu.freq.133=133 MHz
rpipicopicodebug.menu.freq.133.build.f_cpu=133000000L
rpipicopicodebug.menu.freq.150=150 MHz (Overclock)
rpipicopicodebug.menu.freq.150.build.f_cpu=150000000L
rpipicopicodebug.menu.freq.175=175 MHz (Overclock)
rpipicopicodebug.menu.freq.175.build.f_cpu=175000000L
rpipicopicodebug.menu.freq.200=200 MHz (Overclock)
rpipicopicodebug.menu.freq.200.build.f_cpu=200000000L
rpipicopicodebug.menu.freq.225=225 MHz (Overclock)
rpipicopicodebug.menu.freq.225.build.f_cpu=225000000L
rpipicopicodebug.menu.freq.250=250 MHz (Overclock)
rpipicopicodebug.menu.freq.250.build.f_cpu=250000000L
rpipicopicodebug.menu.freq.275=275 MHz (Overclock)
rpipicopicodebug.menu.freq.275.build.f_cpu=275000000L
rpipicopicodebug.menu.freq.300=300 MHz (Overclock)
rpipicopicodebug.menu.freq.300.build.f_cpu=300000000L
rpipicopicodebug.menu.opt.Small=Small (-Os) (standard)
rpipicopicodebug.menu.opt.Small.build.flags.optimize=-Os
rpipicopicodebug.menu.opt.Optimize=Optimize (-O)
rpipicopicodebug.menu.opt.Optimize.build.flags.optimize=-O
rpipicopicodebug.menu.opt.Optimize2=Optimize More (-O2)
rpipicopicodebug.menu.opt.Optimize2.build.flags.optimize=-O2
rpipicopicodebug.menu.opt.Optimize3=Optimize Even More (-O3)
rpipicopicodebug.menu.opt.Optimize3.build.flags.optimize=-O3
rpipicopicodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
rpipicopicodebug.menu.opt.Fast.build.flags.optimize=-Ofast
rpipicopicodebug.menu.opt.Debug=Debug (-Og)
rpipicopicodebug.menu.opt.Debug.build.flags.optimize=-Og
rpipicopicodebug.menu.rtti.Disabled=Disabled
rpipicopicodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
rpipicopicodebug.menu.rtti.Enabled=Enabled
rpipicopicodebug.menu.rtti.Enabled.build.flags.rtti=
rpipicopicodebug.menu.dbgport.Disabled=Disabled
rpipicopicodebug.menu.dbgport.Disabled.build.debug_port=
rpipicopicodebug.menu.dbgport.Serial=Serial
rpipicopicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
rpipicopicodebug.menu.dbgport.Serial1=Serial1
rpipicopicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
rpipicopicodebug.menu.dbgport.Serial2=Serial2
rpipicopicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
rpipicopicodebug.menu.dbglvl.None=None
rpipicopicodebug.menu.dbglvl.None.build.debug_level=
rpipicopicodebug.menu.dbglvl.Core=Core
rpipicopicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
rpipicopicodebug.menu.dbglvl.SPI=SPI
rpipicopicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
rpipicopicodebug.menu.dbglvl.Wire=Wire
rpipicopicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
rpipicopicodebug.menu.dbglvl.All=All
rpipicopicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
rpipicopicodebug.menu.dbglvl.NDEBUG=NDEBUG
rpipicopicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
rpipicopicodebug.menu.usbstack.nousb=No USB
rpipicopicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
rpipicopicodebug.menu.freertos.Disabled=Disabled
rpipicopicodebug.menu.freertos.Disabled.build.flags.freertos=
rpipicopicodebug.menu.freertos.Enabled=Enabled
rpipicopicodebug.menu.freertos.Enabled.build.flags.freertos=-DUSE_FREERTOS

# -----------------------------------
# Adafruit Feather RP2040
# -----------------------------------
adafruit_feather.name=Adafruit Feather RP2040
adafruit_feather.vid.0=0x239a
adafruit_feather.pid.0=0x80f1
adafruit_feather.build.usbpid=-DSERIALUSB_PID=0x80f1
adafruit_feather.build.usbpwr=-DUSBD_MAX_POWER_MA=250
adafruit_feather.build.board=ADAFRUIT_FEATHER_RP2040
adafruit_feather.build.mcu=cortex-m0plus
adafruit_feather.build.variant=adafruit_feather
adafruit_feather.upload.tool=uf2conv
adafruit_feather.upload.maximum_size=8388608
adafruit_feather.upload.maximum_data_size=262144
adafruit_feather.upload.wait_for_upload_port=true
adafruit_feather.upload.erase_cmd=
adafruit_feather.serial.disableDTR=false
adafruit_feather.serial.disableRTS=false
adafruit_feather.build.f_cpu=125000000
adafruit_feather.build.led=
adafruit_feather.build.core=rp2040
adafruit_feather.build.ldscript=memmap_default.ld
adafruit_feather.build.ram_length=256k
adafruit_feather.build.boot2=boot2_w25x10cl_4_padded_checksum
adafruit_feather.build.vid=0x239a
adafruit_feather.build.pid=0x80f1
adafruit_feather.build.usb_manufacturer="Adafruit"
adafruit_feather.build.usb_product="Feather RP2040"
adafruit_feather.menu.flash.8388608_0=8MB (no FS)
adafruit_feather.menu.flash.8388608_0.upload.maximum_size=8384512
adafruit_feather.menu.flash.8388608_0.build.flash_length=8384512
adafruit_feather.menu.flash.8388608_0.build.eeprom_start=276819968
adafruit_feather.menu.flash.8388608_0.build.fs_start=276819968
adafruit_feather.menu.flash.8388608_0.build.fs_end=276819968
adafruit_feather.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
adafruit_feather.menu.flash.8388608_65536.upload.maximum_size=8318976
adafruit_feather.menu.flash.8388608_65536.build.flash_length=8318976
adafruit_feather.menu.flash.8388608_65536.build.eeprom_start=276819968
adafruit_feather.menu.flash.8388608_65536.build.fs_start=276754432
adafruit_feather.menu.flash.8388608_65536.build.fs_end=276819968
adafruit_feather.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
adafruit_feather.menu.flash.8388608_131072.upload.maximum_size=8253440
adafruit_feather.menu.flash.8388608_131072.build.flash_length=8253440
adafruit_feather.menu.flash.8388608_131072.build.eeprom_start=276819968
adafruit_feather.menu.flash.8388608_131072.build.fs_start=276688896
adafruit_feather.menu.flash.8388608_131072.build.fs_end=276819968
adafruit_feather.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
adafruit_feather.menu.flash.8388608_262144.upload.maximum_size=8122368
adafruit_feather.menu.flash.8388608_262144.build.flash_length=8122368
adafruit_feather.menu.flash.8388608_262144.build.eeprom_start=276819968
adafruit_feather.menu.flash.8388608_262144.build.fs_start=276557824
adafruit_feather.menu.flash.8388608_262144.build.fs_end=276819968
adafruit_feather.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
adafruit_feather.menu.flash.8388608_524288.upload.maximum_size=7860224
adafruit_feather.menu.flash.8388608_524288.build.flash_length=7860224
adafruit_feather.menu.flash.8388608_524288.build.eeprom_start=276819968
adafruit_feather.menu.flash.8388608_524288.build.fs_start=276295680
adafruit_feather.menu.flash.8388608_524288.build.fs_end=276819968
adafruit_feather.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
adafruit_feather.menu.flash.8388608_1048576.upload.maximum_size=7335936
adafruit_feather.menu.flash.8388608_1048576.build.flash_length=7335936
adafruit_feather.menu.flash.8388608_1048576.build.eeprom_start=276819968
adafruit_feather.menu.flash.8388608_1048576.build.fs_start=275771392
adafruit_feather.menu.flash.8388608_1048576.build.fs_end=276819968
adafruit_feather.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
adafruit_feather.menu.flash.8388608_2097152.upload.maximum_size=6287360
adafruit_feather.menu.flash.8388608_2097152.build.flash_length=6287360
adafruit_feather.menu.flash.8388608_2097152.build.eeprom_start=276819968
adafruit_feather.menu.flash.8388608_2097152.build.fs_start=274722816
adafruit_feather.menu.flash.8388608_2097152.build.fs_end=276819968
adafruit_feather.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
adafruit_feather.menu.flash.8388608_3145728.upload.maximum_size=5238784
adafruit_feather.menu.flash.8388608_3145728.build.flash_length=5238784
adafruit_feather.menu.flash.8388608_3145728.build.eeprom_start=276819968
adafruit_feather.menu.flash.8388608_3145728.build.fs_start=273674240
adafruit_feather.menu.flash.8388608_3145728.build.fs_end=276819968
adafruit_feather.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
adafruit_feather.menu.flash.8388608_4194304.upload.maximum_size=4190208
adafruit_feather.menu.flash.8388608_4194304.build.flash_length=4190208
adafruit_feather.menu.flash.8388608_4194304.build.eeprom_start=276819968
adafruit_feather.menu.flash.8388608_4194304.build.fs_start=272625664
adafruit_feather.menu.flash.8388608_4194304.build.fs_end=276819968
adafruit_feather.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
adafruit_feather.menu.flash.8388608_5242880.upload.maximum_size=3141632
adafruit_feather.menu.flash.8388608_5242880.build.flash_length=3141632
adafruit_feather.menu.flash.8388608_5242880.build.eeprom_start=276819968
adafruit_feather.menu.flash.8388608_5242880.build.fs_start=271577088
adafruit_feather.menu.flash.8388608_5242880.build.fs_end=276819968
adafruit_feather.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
adafruit_feather.menu.flash.8388608_6291456.upload.maximum_size=2093056
adafruit_feather.menu.flash.8388608_6291456.build.flash_length=2093056
adafruit_feather.menu.flash.8388608_6291456.build.eeprom_start=276819968
adafruit_feather.menu.flash.8388608_6291456.build.fs_start=270528512
adafruit_feather.menu.flash.8388608_6291456.build.fs_end=276819968
adafruit_feather.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
adafruit_feather.menu.flash.8388608_7340032.upload.maximum_size=1044480
adafruit_feather.menu.flash.8388608_7340032.build.flash_length=1044480
adafruit_feather.menu.flash.8388608_7340032.build.eeprom_start=276819968
adafruit_feather.menu.flash.8388608_7340032.build.fs_start=269479936
adafruit_feather.menu.flash.8388608_7340032.build.fs_end=276819968
adafruit_feather.menu.freq.125=125 MHz
adafruit_feather.menu.freq.125.build.f_cpu=125000000L
adafruit_feather.menu.freq.50=50 MHz
adafruit_feather.menu.freq.50.build.f_cpu=50000000L
adafruit_feather.menu.freq.100=100 MHz
adafruit_feather.menu.freq.100.build.f_cpu=100000000L
adafruit_feather.menu.freq.133=133 MHz
adafruit_feather.menu.freq.133.build.f_cpu=133000000L
adafruit_feather.menu.freq.150=150 MHz (Overclock)
adafruit_feather.menu.freq.150.build.f_cpu=150000000L
adafruit_feather.menu.freq.175=175 MHz (Overclock)
adafruit_feather.menu.freq.175.build.f_cpu=175000000L
adafruit_feather.menu.freq.200=200 MHz (Overclock)
adafruit_feather.menu.freq.200.build.f_cpu=200000000L
adafruit_feather.menu.freq.225=225 MHz (Overclock)
adafruit_feather.menu.freq.225.build.f_cpu=225000000L
adafruit_feather.menu.freq.250=250 MHz (Overclock)
adafruit_feather.menu.freq.250.build.f_cpu=250000000L
adafruit_feather.menu.freq.275=275 MHz (Overclock)
adafruit_feather.menu.freq.275.build.f_cpu=275000000L
adafruit_feather.menu.freq.300=300 MHz (Overclock)
adafruit_feather.menu.freq.300.build.f_cpu=300000000L
adafruit_feather.menu.opt.Small=Small (-Os) (standard)
adafruit_feather.menu.opt.Small.build.flags.optimize=-Os
adafruit_feather.menu.opt.Optimize=Optimize (-O)
adafruit_feather.menu.opt.Optimize.build.flags.optimize=-O
adafruit_feather.menu.opt.Optimize2=Optimize More (-O2)
adafruit_feather.menu.opt.Optimize2.build.flags.optimize=-O2
adafruit_feather.menu.opt.Optimize3=Optimize Even More (-O3)
adafruit_feather.menu.opt.Optimize3.build.flags.optimize=-O3
adafruit_feather.menu.opt.Fast=Fast (-Ofast) (maybe slower)
adafruit_feather.menu.opt.Fast.build.flags.optimize=-Ofast
adafruit_feather.menu.opt.Debug=Debug (-Og)
adafruit_feather.menu.opt.Debug.build.flags.optimize=-Og
adafruit_feather.menu.rtti.Disabled=Disabled
adafruit_feather.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
adafruit_feather.menu.rtti.Enabled=Enabled
adafruit_feather.menu.rtti.Enabled.build.flags.rtti=
adafruit_feather.menu.dbgport.Disabled=Disabled
adafruit_feather.menu.dbgport.Disabled.build.debug_port=
adafruit_feather.menu.dbgport.Serial=Serial
adafruit_feather.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
adafruit_feather.menu.dbgport.Serial1=Serial1
adafruit_feather.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
adafruit_feather.menu.dbgport.Serial2=Serial2
adafruit_feather.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
adafruit_feather.menu.dbglvl.None=None
adafruit_feather.menu.dbglvl.None.build.debug_level=
adafruit_feather.menu.dbglvl.Core=Core
adafruit_feather.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
adafruit_feather.menu.dbglvl.SPI=SPI
adafruit_feather.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
adafruit_feather.menu.dbglvl.Wire=Wire
adafruit_feather.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
adafruit_feather.menu.dbglvl.All=All
adafruit_feather.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
adafruit_feather.menu.dbglvl.NDEBUG=NDEBUG
adafruit_feather.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
adafruit_feather.menu.usbstack.picosdk=Pico SDK
adafruit_feather.menu.usbstack.picosdk.build.usbstack_flags="-I{runtime.platform.path}/tools/libpico"
adafruit_feather.menu.usbstack.tinyusb=Adafruit TinyUSB
adafruit_feather.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
adafruit_feather.menu.freertos.Disabled=Disabled
adafruit_feather.menu.freertos.Disabled.build.flags.freertos=
adafruit_feather.menu.freertos.Enabled=Enabled
adafruit_feather.menu.freertos.Enabled.build.flags.freertos=-DUSE_FREERTOS

