earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Solder Party RP2040 Stamp (pico-debug)
# -----------------------------------
solderparty_rp2040_stamppicodebug.name=Solder Party RP2040 Stamp (pico-debug)
solderparty_rp2040_stamppicodebug.vid.0=0x1209
solderparty_rp2040_stamppicodebug.pid.0=0x2488
solderparty_rp2040_stamppicodebug.build.usbpid=-DSERIALUSB_PID=0xa182
solderparty_rp2040_stamppicodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=500
solderparty_rp2040_stamppicodebug.build.board=SOLDERPARTY_RP2040_STAMP
solderparty_rp2040_stamppicodebug.build.mcu=cortex-m0plus
solderparty_rp2040_stamppicodebug.build.variant=solderparty_rp2040_stamp
solderparty_rp2040_stamppicodebug.upload.tool=picodebug
solderparty_rp2040_stamppicodebug.upload.maximum_size=8388608
solderparty_rp2040_stamppicodebug.upload.maximum_data_size=245760
solderparty_rp2040_stamppicodebug.upload.wait_for_upload_port=true
solderparty_rp2040_stamppicodebug.upload.erase_cmd=
solderparty_rp2040_stamppicodebug.serial.disableDTR=false
solderparty_rp2040_stamppicodebug.serial.disableRTS=false
solderparty_rp2040_stamppicodebug.build.f_cpu=125000000
solderparty_rp2040_stamppicodebug.build.led=
solderparty_rp2040_stamppicodebug.build.core=rp2040
solderparty_rp2040_stamppicodebug.build.ldscript=memmap_default.ld
solderparty_rp2040_stamppicodebug.build.ram_length=240k
solderparty_rp2040_stamppicodebug.build.boot2=boot2_generic_03h_4_padded_checksum
solderparty_rp2040_stamppicodebug.build.vid=0x1209
solderparty_rp2040_stamppicodebug.build.pid=0xa182
solderparty_rp2040_stamppicodebug.build.usb_manufacturer="Solder Party"
solderparty_rp2040_stamppicodebug.build.usb_product="RP2040 Stamp (pico-debug)"
solderparty_rp2040_stamppicodebug.menu.flash.8388608_0=8MB (no FS)
solderparty_rp2040_stamppicodebug.menu.flash.8388608_0.upload.maximum_size=8384512
solderparty_rp2040_stamppicodebug.menu.flash.8388608_0.build.flash_length=8384512
solderparty_rp2040_stamppicodebug.menu.flash.8388608_0.build.eeprom_start=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_0.build.fs_start=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_0.build.fs_end=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
solderparty_rp2040_stamppicodebug.menu.flash.8388608_65536.upload.maximum_size=8318976
solderparty_rp2040_stamppicodebug.menu.flash.8388608_65536.build.flash_length=8318976
solderparty_rp2040_stamppicodebug.menu.flash.8388608_65536.build.eeprom_start=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_65536.build.fs_start=276754432
solderparty_rp2040_stamppicodebug.menu.flash.8388608_65536.build.fs_end=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
solderparty_rp2040_stamppicodebug.menu.flash.8388608_131072.upload.maximum_size=8253440
solderparty_rp2040_stamppicodebug.menu.flash.8388608_131072.build.flash_length=8253440
solderparty_rp2040_stamppicodebug.menu.flash.8388608_131072.build.eeprom_start=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_131072.build.fs_start=276688896
solderparty_rp2040_stamppicodebug.menu.flash.8388608_131072.build.fs_end=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
solderparty_rp2040_stamppicodebug.menu.flash.8388608_262144.upload.maximum_size=8122368
solderparty_rp2040_stamppicodebug.menu.flash.8388608_262144.build.flash_length=8122368
solderparty_rp2040_stamppicodebug.menu.flash.8388608_262144.build.eeprom_start=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_262144.build.fs_start=276557824
solderparty_rp2040_stamppicodebug.menu.flash.8388608_262144.build.fs_end=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
solderparty_rp2040_stamppicodebug.menu.flash.8388608_524288.upload.maximum_size=7860224
solderparty_rp2040_stamppicodebug.menu.flash.8388608_524288.build.flash_length=7860224
solderparty_rp2040_stamppicodebug.menu.flash.8388608_524288.build.eeprom_start=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_524288.build.fs_start=276295680
solderparty_rp2040_stamppicodebug.menu.flash.8388608_524288.build.fs_end=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
solderparty_rp2040_stamppicodebug.menu.flash.8388608_1048576.upload.maximum_size=7335936
solderparty_rp2040_stamppicodebug.menu.flash.8388608_1048576.build.flash_length=7335936
solderparty_rp2040_stamppicodebug.menu.flash.8388608_1048576.build.eeprom_start=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_1048576.build.fs_start=275771392
solderparty_rp2040_stamppicodebug.menu.flash.8388608_1048576.build.fs_end=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
solderparty_rp2040_stamppicodebug.menu.flash.8388608_2097152.upload.maximum_size=6287360
solderparty_rp2040_stamppicodebug.menu.flash.8388608_2097152.build.flash_length=6287360
solderparty_rp2040_stamppicodebug.menu.flash.8388608_2097152.build.eeprom_start=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_2097152.build.fs_start=274722816
solderparty_rp2040_stamppicodebug.menu.flash.8388608_2097152.build.fs_end=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
solderparty_rp2040_stamppicodebug.menu.flash.8388608_3145728.upload.maximum_size=5238784
solderparty_rp2040_stamppicodebug.menu.flash.8388608_3145728.build.flash_length=5238784
solderparty_rp2040_stamppicodebug.menu.flash.8388608_3145728.build.eeprom_start=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_3145728.build.fs_start=273674240
solderparty_rp2040_stamppicodebug.menu.flash.8388608_3145728.build.fs_end=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
solderparty_rp2040_stamppicodebug.menu.flash.8388608_4194304.upload.maximum_size=4190208
solderparty_rp2040_stamppicodebug.menu.flash.8388608_4194304.build.flash_length=4190208
solderparty_rp2040_stamppicodebug.menu.flash.8388608_4194304.build.eeprom_start=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_4194304.build.fs_start=272625664
solderparty_rp2040_stamppicodebug.menu.flash.8388608_4194304.build.fs_end=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
solderparty_rp2040_stamppicodebug.menu.flash.8388608_5242880.upload.maximum_size=3141632
solderparty_rp2040_stamppicodebug.menu.flash.8388608_5242880.build.flash_length=3141632
solderparty_rp2040_stamppicodebug.menu.flash.8388608_5242880.build.eeprom_start=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_5242880.build.fs_start=271577088
solderparty_rp2040_stamppicodebug.menu.flash.8388608_5242880.build.fs_end=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
solderparty_rp2040_stamppicodebug.menu.flash.8388608_6291456.upload.maximum_size=2093056
solderparty_rp2040_stamppicodebug.menu.flash.8388608_6291456.build.flash_length=2093056
solderparty_rp2040_stamppicodebug.menu.flash.8388608_6291456.build.eeprom_start=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_6291456.build.fs_start=270528512
solderparty_rp2040_stamppicodebug.menu.flash.8388608_6291456.build.fs_end=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
solderparty_rp2040_stamppicodebug.menu.flash.8388608_7340032.upload.maximum_size=1044480
solderparty_rp2040_stamppicodebug.menu.flash.8388608_7340032.build.flash_length=1044480
solderparty_rp2040_stamppicodebug.menu.flash.8388608_7340032.build.eeprom_start=276819968
solderparty_rp2040_stamppicodebug.menu.flash.8388608_7340032.build.fs_start=269479936
solderparty_rp2040_stamppicodebug.menu.flash.8388608_7340032.build.fs_end=276819968
solderparty_rp2040_stamppicodebug.menu.freq.125=125 MHz
solderparty_rp2040_stamppicodebug.menu.freq.125.build.f_cpu=125000000L
solderparty_rp2040_stamppicodebug.menu.freq.50=50 MHz
solderparty_rp2040_stamppicodebug.menu.freq.50.build.f_cpu=50000000L
solderparty_rp2040_stamppicodebug.menu.freq.100=100 MHz
solderparty_rp2040_stamppicodebug.menu.freq.100.build.f_cpu=100000000L
solderparty_rp2040_stamppicodebug.menu.freq.133=133 MHz
solderparty_rp2040_stamppicodebug.menu.freq.133.build.f_cpu=133000000L
solderparty_rp2040_stamppicodebug.menu.freq.150=150 MHz (Overclock)
solderparty_rp2040_stamppicodebug.menu.freq.150.build.f_cpu=150000000L
solderparty_rp2040_stamppicodebug.menu.freq.175=175 MHz (Overclock)
solderparty_rp2040_stamppicodebug.menu.freq.175.build.f_cpu=175000000L
solderparty_rp2040_stamppicodebug.menu.freq.200=200 MHz (Overclock)
solderparty_rp2040_stamppicodebug.menu.freq.200.build.f_cpu=200000000L
solderparty_rp2040_stamppicodebug.menu.freq.225=225 MHz (Overclock)
solderparty_rp2040_stamppicodebug.menu.freq.225.build.f_cpu=225000000L
solderparty_rp2040_stamppicodebug.menu.freq.250=250 MHz (Overclock)
solderparty_rp2040_stamppicodebug.menu.freq.250.build.f_cpu=250000000L
solderparty_rp2040_stamppicodebug.menu.freq.275=275 MHz (Overclock)
solderparty_rp2040_stamppicodebug.menu.freq.275.build.f_cpu=275000000L
solderparty_rp2040_stamppicodebug.menu.freq.300=300 MHz (Overclock)
solderparty_rp2040_stamppicodebug.menu.freq.300.build.f_cpu=300000000L
solderparty_rp2040_stamppicodebug.menu.opt.Small=Small (-Os) (standard)
solderparty_rp2040_stamppicodebug.menu.opt.Small.build.flags.optimize=-Os
solderparty_rp2040_stamppicodebug.menu.opt.Optimize=Optimize (-O)
solderparty_rp2040_stamppicodebug.menu.opt.Optimize.build.flags.optimize=-O
solderparty_rp2040_stamppicodebug.menu.opt.Optimize2=Optimize More (-O2)
solderparty_rp2040_stamppicodebug.menu.opt.Optimize2.build.flags.optimize=-O2
solderparty_rp2040_stamppicodebug.menu.opt.Optimize3=Optimize Even More (-O3)
solderparty_rp2040_stamppicodebug.menu.opt.Optimize3.build.flags.optimize=-O3
solderparty_rp2040_stamppicodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
solderparty_rp2040_stamppicodebug.menu.opt.Fast.build.flags.optimize=-Ofast
solderparty_rp2040_stamppicodebug.menu.opt.Debug=Debug (-Og)
solderparty_rp2040_stamppicodebug.menu.opt.Debug.build.flags.optimize=-Og
solderparty_rp2040_stamppicodebug.menu.rtti.Disabled=Disabled
solderparty_rp2040_stamppicodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
solderparty_rp2040_stamppicodebug.menu.rtti.Enabled=Enabled
solderparty_rp2040_stamppicodebug.menu.rtti.Enabled.build.flags.rtti=
solderparty_rp2040_stamppicodebug.menu.dbgport.Disabled=Disabled
solderparty_rp2040_stamppicodebug.menu.dbgport.Disabled.build.debug_port=
solderparty_rp2040_stamppicodebug.menu.dbgport.Serial=Serial
solderparty_rp2040_stamppicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
solderparty_rp2040_stamppicodebug.menu.dbgport.Serial1=Serial1
solderparty_rp2040_stamppicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
solderparty_rp2040_stamppicodebug.menu.dbgport.Serial2=Serial2
solderparty_rp2040_stamppicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
solderparty_rp2040_stamppicodebug.menu.dbglvl.None=None
solderparty_rp2040_stamppicodebug.menu.dbglvl.None.build.debug_level=
solderparty_rp2040_stamppicodebug.menu.dbglvl.Core=Core
solderparty_rp2040_stamppicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
solderparty_rp2040_stamppicodebug.menu.dbglvl.SPI=SPI
solderparty_rp2040_stamppicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
solderparty_rp2040_stamppicodebug.menu.dbglvl.Wire=Wire
solderparty_rp2040_stamppicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
solderparty_rp2040_stamppicodebug.menu.dbglvl.All=All
solderparty_rp2040_stamppicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
solderparty_rp2040_stamppicodebug.menu.dbglvl.NDEBUG=NDEBUG
solderparty_rp2040_stamppicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
solderparty_rp2040_stamppicodebug.menu.usbstack.nousb=No USB
solderparty_rp2040_stamppicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
solderparty_rp2040_stamppicodebug.menu.freertos.Disabled=Disabled
solderparty_rp2040_stamppicodebug.menu.freertos.Disabled.build.flags.freertos=
solderparty_rp2040_stamppicodebug.menu.freertos.Enabled=Enabled
solderparty_rp2040_stamppicodebug.menu.freertos.Enabled.build.flags.freertos=-DUSE_FREERTOS

