earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# SparkFun ProMicro RP2040 (Picoprobe)
# -----------------------------------
sparkfun_promicrorp2040picoprobe.name=SparkFun ProMicro RP2040 (Picoprobe)
sparkfun_promicrorp2040picoprobe.vid.0=0x1b4f
sparkfun_promicrorp2040picoprobe.pid.0=0x0004
sparkfun_promicrorp2040picoprobe.build.usbpid=-DSERIALUSB_PID=0x0026
sparkfun_promicrorp2040picoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=250
sparkfun_promicrorp2040picoprobe.build.board=SPARKFUN_PROMICRO_RP2040
sparkfun_promicrorp2040picoprobe.build.mcu=cortex-m0plus
sparkfun_promicrorp2040picoprobe.build.variant=sparkfun_promicrorp2040
sparkfun_promicrorp2040picoprobe.upload.tool=picoprobe
sparkfun_promicrorp2040picoprobe.upload.maximum_size=16777216
sparkfun_promicrorp2040picoprobe.upload.maximum_data_size=262144
sparkfun_promicrorp2040picoprobe.upload.wait_for_upload_port=true
sparkfun_promicrorp2040picoprobe.upload.erase_cmd=
sparkfun_promicrorp2040picoprobe.serial.disableDTR=false
sparkfun_promicrorp2040picoprobe.serial.disableRTS=false
sparkfun_promicrorp2040picoprobe.build.f_cpu=125000000
sparkfun_promicrorp2040picoprobe.build.led=
sparkfun_promicrorp2040picoprobe.build.core=rp2040
sparkfun_promicrorp2040picoprobe.build.ldscript=memmap_default.ld
sparkfun_promicrorp2040picoprobe.build.ram_length=256k
sparkfun_promicrorp2040picoprobe.build.boot2=boot2_generic_03h_4_padded_checksum
sparkfun_promicrorp2040picoprobe.build.vid=0x1b4f
sparkfun_promicrorp2040picoprobe.build.pid=0x0026
sparkfun_promicrorp2040picoprobe.build.usb_manufacturer="SparkFun"
sparkfun_promicrorp2040picoprobe.build.usb_product="ProMicro RP2040 (Picoprobe)"
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_0=16MB (no FS)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_0.upload.maximum_size=16773120
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_0.build.flash_length=16773120
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_0.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_0.build.fs_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_0.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_65536.upload.maximum_size=16707584
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_65536.build.flash_length=16707584
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_65536.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_65536.build.fs_start=285143040
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_65536.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_131072.upload.maximum_size=16642048
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_131072.build.flash_length=16642048
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_131072.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_131072.build.fs_start=285077504
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_131072.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_262144.upload.maximum_size=16510976
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_262144.build.flash_length=16510976
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_262144.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_262144.build.fs_start=284946432
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_262144.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_524288.upload.maximum_size=16248832
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_524288.build.flash_length=16248832
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_524288.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_524288.build.fs_start=284684288
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_524288.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_1048576.upload.maximum_size=15724544
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_1048576.build.flash_length=15724544
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_1048576.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_1048576.build.fs_start=284160000
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_1048576.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_2097152.upload.maximum_size=14675968
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_2097152.build.flash_length=14675968
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_2097152.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_2097152.build.fs_start=283111424
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_2097152.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_3145728.upload.maximum_size=13627392
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_3145728.build.flash_length=13627392
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_3145728.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_3145728.build.fs_start=282062848
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_3145728.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_4194304.upload.maximum_size=12578816
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_4194304.build.flash_length=12578816
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_4194304.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_4194304.build.fs_start=281014272
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_4194304.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_5242880.upload.maximum_size=11530240
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_5242880.build.flash_length=11530240
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_5242880.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_5242880.build.fs_start=279965696
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_5242880.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_6291456.upload.maximum_size=10481664
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_6291456.build.flash_length=10481664
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_6291456.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_6291456.build.fs_start=278917120
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_6291456.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_7340032.upload.maximum_size=9433088
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_7340032.build.flash_length=9433088
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_7340032.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_7340032.build.fs_start=277868544
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_7340032.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_8388608.upload.maximum_size=8384512
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_8388608.build.flash_length=8384512
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_8388608.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_8388608.build.fs_start=276819968
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_8388608.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_9437184.upload.maximum_size=7335936
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_9437184.build.flash_length=7335936
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_9437184.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_9437184.build.fs_start=275771392
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_9437184.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_10485760.upload.maximum_size=6287360
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_10485760.build.flash_length=6287360
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_10485760.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_10485760.build.fs_start=274722816
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_10485760.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_11534336.upload.maximum_size=5238784
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_11534336.build.flash_length=5238784
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_11534336.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_11534336.build.fs_start=273674240
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_11534336.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_12582912.upload.maximum_size=4190208
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_12582912.build.flash_length=4190208
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_12582912.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_12582912.build.fs_start=272625664
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_12582912.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_13631488.upload.maximum_size=3141632
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_13631488.build.flash_length=3141632
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_13631488.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_13631488.build.fs_start=271577088
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_13631488.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_14680064.upload.maximum_size=2093056
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_14680064.build.flash_length=2093056
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_14680064.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_14680064.build.fs_start=270528512
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_14680064.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_15728640.upload.maximum_size=1044480
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_15728640.build.flash_length=1044480
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_15728640.build.eeprom_start=285208576
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_15728640.build.fs_start=269479936
sparkfun_promicrorp2040picoprobe.menu.flash.16777216_15728640.build.fs_end=285208576
sparkfun_promicrorp2040picoprobe.menu.freq.125=125 MHz
sparkfun_promicrorp2040picoprobe.menu.freq.125.build.f_cpu=125000000L
sparkfun_promicrorp2040picoprobe.menu.freq.50=50 MHz
sparkfun_promicrorp2040picoprobe.menu.freq.50.build.f_cpu=50000000L
sparkfun_promicrorp2040picoprobe.menu.freq.100=100 MHz
sparkfun_promicrorp2040picoprobe.menu.freq.100.build.f_cpu=100000000L
sparkfun_promicrorp2040picoprobe.menu.freq.133=133 MHz
sparkfun_promicrorp2040picoprobe.menu.freq.133.build.f_cpu=133000000L
sparkfun_promicrorp2040picoprobe.menu.freq.150=150 MHz (Overclock)
sparkfun_promicrorp2040picoprobe.menu.freq.150.build.f_cpu=150000000L
sparkfun_promicrorp2040picoprobe.menu.freq.175=175 MHz (Overclock)
sparkfun_promicrorp2040picoprobe.menu.freq.175.build.f_cpu=175000000L
sparkfun_promicrorp2040picoprobe.menu.freq.200=200 MHz (Overclock)
sparkfun_promicrorp2040picoprobe.menu.freq.200.build.f_cpu=200000000L
sparkfun_promicrorp2040picoprobe.menu.freq.225=225 MHz (Overclock)
sparkfun_promicrorp2040picoprobe.menu.freq.225.build.f_cpu=225000000L
sparkfun_promicrorp2040picoprobe.menu.freq.250=250 MHz (Overclock)
sparkfun_promicrorp2040picoprobe.menu.freq.250.build.f_cpu=250000000L
sparkfun_promicrorp2040picoprobe.menu.freq.275=275 MHz (Overclock)
sparkfun_promicrorp2040picoprobe.menu.freq.275.build.f_cpu=275000000L
sparkfun_promicrorp2040picoprobe.menu.freq.300=300 MHz (Overclock)
sparkfun_promicrorp2040picoprobe.menu.freq.300.build.f_cpu=300000000L
sparkfun_promicrorp2040picoprobe.menu.opt.Small=Small (-Os) (standard)
sparkfun_promicrorp2040picoprobe.menu.opt.Small.build.flags.optimize=-Os
sparkfun_promicrorp2040picoprobe.menu.opt.Optimize=Optimize (-O)
sparkfun_promicrorp2040picoprobe.menu.opt.Optimize.build.flags.optimize=-O
sparkfun_promicrorp2040picoprobe.menu.opt.Optimize2=Optimize More (-O2)
sparkfun_promicrorp2040picoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
sparkfun_promicrorp2040picoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
sparkfun_promicrorp2040picoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
sparkfun_promicrorp2040picoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
sparkfun_promicrorp2040picoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
sparkfun_promicrorp2040picoprobe.menu.opt.Debug=Debug (-Og)
sparkfun_promicrorp2040picoprobe.menu.opt.Debug.build.flags.optimize=-Og
sparkfun_promicrorp2040picoprobe.menu.rtti.Disabled=Disabled
sparkfun_promicrorp2040picoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
sparkfun_promicrorp2040picoprobe.menu.rtti.Enabled=Enabled
sparkfun_promicrorp2040picoprobe.menu.rtti.Enabled.build.flags.rtti=
sparkfun_promicrorp2040picoprobe.menu.dbgport.Disabled=Disabled
sparkfun_promicrorp2040picoprobe.menu.dbgport.Disabled.build.debug_port=
sparkfun_promicrorp2040picoprobe.menu.dbgport.Serial=Serial
sparkfun_promicrorp2040picoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
sparkfun_promicrorp2040picoprobe.menu.dbgport.Serial1=Serial1
sparkfun_promicrorp2040picoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
sparkfun_promicrorp2040picoprobe.menu.dbgport.Serial2=Serial2
sparkfun_promicrorp2040picoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
sparkfun_promicrorp2040picoprobe.menu.dbglvl.None=None
sparkfun_promicrorp2040picoprobe.menu.dbglvl.None.build.debug_level=
sparkfun_promicrorp2040picoprobe.menu.dbglvl.Core=Core
sparkfun_promicrorp2040picoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
sparkfun_promicrorp2040picoprobe.menu.dbglvl.SPI=SPI
sparkfun_promicrorp2040picoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
sparkfun_promicrorp2040picoprobe.menu.dbglvl.Wire=Wire
sparkfun_promicrorp2040picoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
sparkfun_promicrorp2040picoprobe.menu.dbglvl.All=All
sparkfun_promicrorp2040picoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
sparkfun_promicrorp2040picoprobe.menu.dbglvl.NDEBUG=NDEBUG
sparkfun_promicrorp2040picoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
sparkfun_promicrorp2040picoprobe.menu.usbstack.picosdk=Pico SDK
sparkfun_promicrorp2040picoprobe.menu.usbstack.picosdk.build.usbstack_flags="-I{runtime.platform.path}/tools/libpico"
sparkfun_promicrorp2040picoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
sparkfun_promicrorp2040picoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sparkfun_promicrorp2040picoprobe.menu.freertos.Disabled=Disabled
sparkfun_promicrorp2040picoprobe.menu.freertos.Disabled.build.flags.freertos=
sparkfun_promicrorp2040picoprobe.menu.freertos.Enabled=Enabled
sparkfun_promicrorp2040picoprobe.menu.freertos.Enabled.build.flags.freertos=-DUSE_FREERTOS

