earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# WIZnet W5100S-EVB-Pico (Picoprobe)
# -----------------------------------
wiznet_5100s_evb_picopicoprobe.name=WIZnet W5100S-EVB-Pico (Picoprobe)
wiznet_5100s_evb_picopicoprobe.vid.0=0x2e8a
wiznet_5100s_evb_picopicoprobe.pid.0=0x0004
wiznet_5100s_evb_picopicoprobe.build.usbpid=-DSERIALUSB_PID=0x1008
wiznet_5100s_evb_picopicoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=250
wiznet_5100s_evb_picopicoprobe.build.board=WIZNET_5100S_EVB_PICO
wiznet_5100s_evb_picopicoprobe.build.mcu=cortex-m0plus
wiznet_5100s_evb_picopicoprobe.build.variant=wiznet_5100s_evb_pico
wiznet_5100s_evb_picopicoprobe.upload.tool=picoprobe
wiznet_5100s_evb_picopicoprobe.upload.maximum_size=2097152
wiznet_5100s_evb_picopicoprobe.upload.maximum_data_size=262144
wiznet_5100s_evb_picopicoprobe.upload.wait_for_upload_port=true
wiznet_5100s_evb_picopicoprobe.upload.erase_cmd=
wiznet_5100s_evb_picopicoprobe.serial.disableDTR=false
wiznet_5100s_evb_picopicoprobe.serial.disableRTS=false
wiznet_5100s_evb_picopicoprobe.build.f_cpu=125000000
wiznet_5100s_evb_picopicoprobe.build.led=
wiznet_5100s_evb_picopicoprobe.build.core=rp2040
wiznet_5100s_evb_picopicoprobe.build.ldscript=memmap_default.ld
wiznet_5100s_evb_picopicoprobe.build.ram_length=256k
wiznet_5100s_evb_picopicoprobe.build.boot2=boot2_w25q080_2_padded_checksum
wiznet_5100s_evb_picopicoprobe.build.vid=0x2e8a
wiznet_5100s_evb_picopicoprobe.build.pid=0x1008
wiznet_5100s_evb_picopicoprobe.build.usb_manufacturer="WIZnet"
wiznet_5100s_evb_picopicoprobe.build.usb_product="W5100S-EVB-Pico (Picoprobe)"
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_0=2MB (no FS)
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_0.upload.maximum_size=2093056
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_0.build.flash_length=2093056
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_0.build.eeprom_start=270528512
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_0.build.fs_start=270528512
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_0.build.fs_end=270528512
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_65536.upload.maximum_size=2027520
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_65536.build.flash_length=2027520
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_65536.build.eeprom_start=270528512
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_65536.build.fs_start=270462976
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_65536.build.fs_end=270528512
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_131072.upload.maximum_size=1961984
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_131072.build.flash_length=1961984
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_131072.build.eeprom_start=270528512
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_131072.build.fs_start=270397440
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_131072.build.fs_end=270528512
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_262144.upload.maximum_size=1830912
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_262144.build.flash_length=1830912
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_262144.build.eeprom_start=270528512
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_262144.build.fs_start=270266368
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_262144.build.fs_end=270528512
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_524288.upload.maximum_size=1568768
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_524288.build.flash_length=1568768
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_524288.build.eeprom_start=270528512
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_524288.build.fs_start=270004224
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_524288.build.fs_end=270528512
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_1048576.upload.maximum_size=1044480
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_1048576.build.flash_length=1044480
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_1048576.build.eeprom_start=270528512
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_1048576.build.fs_start=269479936
wiznet_5100s_evb_picopicoprobe.menu.flash.2097152_1048576.build.fs_end=270528512
wiznet_5100s_evb_picopicoprobe.menu.freq.125=125 MHz
wiznet_5100s_evb_picopicoprobe.menu.freq.125.build.f_cpu=125000000L
wiznet_5100s_evb_picopicoprobe.menu.freq.50=50 MHz
wiznet_5100s_evb_picopicoprobe.menu.freq.50.build.f_cpu=50000000L
wiznet_5100s_evb_picopicoprobe.menu.freq.100=100 MHz
wiznet_5100s_evb_picopicoprobe.menu.freq.100.build.f_cpu=100000000L
wiznet_5100s_evb_picopicoprobe.menu.freq.133=133 MHz
wiznet_5100s_evb_picopicoprobe.menu.freq.133.build.f_cpu=133000000L
wiznet_5100s_evb_picopicoprobe.menu.freq.150=150 MHz (Overclock)
wiznet_5100s_evb_picopicoprobe.menu.freq.150.build.f_cpu=150000000L
wiznet_5100s_evb_picopicoprobe.menu.freq.175=175 MHz (Overclock)
wiznet_5100s_evb_picopicoprobe.menu.freq.175.build.f_cpu=175000000L
wiznet_5100s_evb_picopicoprobe.menu.freq.200=200 MHz (Overclock)
wiznet_5100s_evb_picopicoprobe.menu.freq.200.build.f_cpu=200000000L
wiznet_5100s_evb_picopicoprobe.menu.freq.225=225 MHz (Overclock)
wiznet_5100s_evb_picopicoprobe.menu.freq.225.build.f_cpu=225000000L
wiznet_5100s_evb_picopicoprobe.menu.freq.250=250 MHz (Overclock)
wiznet_5100s_evb_picopicoprobe.menu.freq.250.build.f_cpu=250000000L
wiznet_5100s_evb_picopicoprobe.menu.freq.275=275 MHz (Overclock)
wiznet_5100s_evb_picopicoprobe.menu.freq.275.build.f_cpu=275000000L
wiznet_5100s_evb_picopicoprobe.menu.freq.300=300 MHz (Overclock)
wiznet_5100s_evb_picopicoprobe.menu.freq.300.build.f_cpu=300000000L
wiznet_5100s_evb_picopicoprobe.menu.opt.Small=Small (-Os) (standard)
wiznet_5100s_evb_picopicoprobe.menu.opt.Small.build.flags.optimize=-Os
wiznet_5100s_evb_picopicoprobe.menu.opt.Optimize=Optimize (-O)
wiznet_5100s_evb_picopicoprobe.menu.opt.Optimize.build.flags.optimize=-O
wiznet_5100s_evb_picopicoprobe.menu.opt.Optimize2=Optimize More (-O2)
wiznet_5100s_evb_picopicoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
wiznet_5100s_evb_picopicoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
wiznet_5100s_evb_picopicoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
wiznet_5100s_evb_picopicoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
wiznet_5100s_evb_picopicoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
wiznet_5100s_evb_picopicoprobe.menu.opt.Debug=Debug (-Og)
wiznet_5100s_evb_picopicoprobe.menu.opt.Debug.build.flags.optimize=-Og
wiznet_5100s_evb_picopicoprobe.menu.rtti.Disabled=Disabled
wiznet_5100s_evb_picopicoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
wiznet_5100s_evb_picopicoprobe.menu.rtti.Enabled=Enabled
wiznet_5100s_evb_picopicoprobe.menu.rtti.Enabled.build.flags.rtti=
wiznet_5100s_evb_picopicoprobe.menu.dbgport.Disabled=Disabled
wiznet_5100s_evb_picopicoprobe.menu.dbgport.Disabled.build.debug_port=
wiznet_5100s_evb_picopicoprobe.menu.dbgport.Serial=Serial
wiznet_5100s_evb_picopicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
wiznet_5100s_evb_picopicoprobe.menu.dbgport.Serial1=Serial1
wiznet_5100s_evb_picopicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
wiznet_5100s_evb_picopicoprobe.menu.dbgport.Serial2=Serial2
wiznet_5100s_evb_picopicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
wiznet_5100s_evb_picopicoprobe.menu.dbglvl.None=None
wiznet_5100s_evb_picopicoprobe.menu.dbglvl.None.build.debug_level=
wiznet_5100s_evb_picopicoprobe.menu.dbglvl.Core=Core
wiznet_5100s_evb_picopicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
wiznet_5100s_evb_picopicoprobe.menu.dbglvl.SPI=SPI
wiznet_5100s_evb_picopicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
wiznet_5100s_evb_picopicoprobe.menu.dbglvl.Wire=Wire
wiznet_5100s_evb_picopicoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
wiznet_5100s_evb_picopicoprobe.menu.dbglvl.All=All
wiznet_5100s_evb_picopicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
wiznet_5100s_evb_picopicoprobe.menu.dbglvl.NDEBUG=NDEBUG
wiznet_5100s_evb_picopicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
wiznet_5100s_evb_picopicoprobe.menu.usbstack.picosdk=Pico SDK
wiznet_5100s_evb_picopicoprobe.menu.usbstack.picosdk.build.usbstack_flags="-I{runtime.platform.path}/tools/libpico"
wiznet_5100s_evb_picopicoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
wiznet_5100s_evb_picopicoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
wiznet_5100s_evb_picopicoprobe.menu.freertos.Disabled=Disabled
wiznet_5100s_evb_picopicoprobe.menu.freertos.Disabled.build.flags.freertos=
wiznet_5100s_evb_picopicoprobe.menu.freertos.Enabled=Enabled
wiznet_5100s_evb_picopicoprobe.menu.freertos.Enabled.build.flags.freertos=-DUSE_FREERTOS

